Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: The intended use of __wakeup is to reestablish any database connections that may have been lost during serialization and perform other reinitialization tasks.
pt_br: __wakeup é planejado para restabelecer conexões com bancos de dados perdidas durante a serialização e para realizar outras tarefas de reinicialização.

source: References inside the constructor
pt_br: Referências dentro do construtor

source: Creating references within the constructor can lead to confusing results.
pt_br: A criação de referências em construtores pode gerar resultados confusos.

source: This tutorial-like section helps you to avoid problems.
pt_br: Esta seção tentará ajudá-lo e evitar essas situações.

source: class Foo {function Foo($name) {/ / create a reference inside the global array $globalref global $globalref; $globalref[] = $this; / / set name to passed value $this - setName($name); / / and put it out $this - echoName();} function echoName() {echo "br ",$this - name;} function setName($name) {$this - name = $name;}}
pt_br: class Foo {function Foo($name) {/ / cria uma referencia dentro do array global $globalref global $globalref; $globalref[] = $this; / / configura o nome conforme o parametro $this - setName($name); / / e o mostra $this - echoName();} function echoName() {echo "br ",$this - name;} function setName($name) {$this - name = $name;}}

source: Let us check out if there is a difference between $bar1 which has been created using the copy = operator and $bar2 which has been created using the reference = operator...
pt_br: Vamos verificar, abaixo, se há alguma diferença entre $bar1, que foi criado usando operador de cópia =, e $bar2 que foi criado usando o operador de referência =...

source: $bar1 = new Foo( 'set in constructor'); $bar1 - echoName(); $globalref[0] - echoName(); / * output: set in constructor set in constructor set in constructor * / $bar2 = new Foo('set in constructor'); $bar2 - echoName(); $globalref[1] - echoName(); / * output: set in constructor set in constructor set in constructor * /
pt_br: $bar1 = new Foo( 'configurado no construtor'); $bar1 - echoName(); $globalref[0] - echoName(); / * saida: configurado no construtor configurado no construtor configurado no construtor * / $bar2 = new Foo('configurado no construtor'); $bar2 - echoName(); $globalref[1] - echoName(); / * saida: configurado no construtor configurado no construtor configurado no construtor * /

source: Apparently there is no difference, but in fact there is a very significant one: $bar1 and $globalref[ 0] are _NOT_ referenced, they are NOT the same variable.
pt_br: Aparentemente não há nenhuma diferença, mas de fato há uma muito significativa: $bar1 e $globalref[ 0] não se referenciam, elas NÃO são a mesma variável.

source: This is because "new" does not return a reference by default, instead it returns a copy.
pt_br: Ao invés, retorna uma cópia.

source: There is no performance loss (since PHP 4 and up use reference counting) returning copies instead of references.
pt_br: Isto não causa perda de performance (desde que o PHP 4 usa a contagem de referências) retornando copias em vez de referências.

source: On the contrary it is most often better to simply work with copies instead of references, because creating references takes some time where creating copies virtually takes no time (unless none of them is a large array or object and one of them gets changed and the other(s) one(s) subsequently, then it would be wise to use references to change them all concurrently).
pt_br: Do contrário, isso oferece melhora por simplificar o trabalho com cópias ao invés de referências, porque a criação de referências toma mais tempo enquanto a criação de cópias virtualmente não toma tempo algum (a não ser no caso de grandes arrays ou objetos, onde um deles é modificado e o(s) outro(s) também na seqüência, então é melhor usar referências para mudar todos ao mesmo tempo).

source: / / now we will change the name. what do you expect? / / you could expect that both $bar1 and $globalref[ 0] change their names... $bar1 - setName('set from outside'); / / as mentioned before this is not the case. $bar1 - echoName(); $globalref[0] - echoName(); / * output: set from outside set in constructor * / / / let us see what is different with $bar2 and $globalref[1] $bar2 - setName('set from outside'); / / luckily they are not only equal, they are the same variable / / thus $bar2 - name and $globalref[1] - name are the same too $bar2 - echoName(); $globalref[1] - echoName(); / * output: set from outside set from outside * /
pt_br: O que voce espera? / / Voce pode acreditar que ambos $bar1 e $globalref[ 0] mudem seus nomes... $bar1 - setName('configurado por fora'); / / Como mencionado, este nao eh o caso. $bar1 - echoName(); $globalref[0] - echoName(); / * output: configurado por fora configurado no construtor * / / / Agora vamos ver a diferenca entre $bar2 e $globalref[1] $bar2 - setName('configurado por fora'); / / Por sorte, eles nao sao apenas iguais, eles sao a mesma variavel / / Assim, $bar2 - name e $globalref[1] - name sao o mesmo tambem $bar2 - echoName(); $globalref[1] - echoName(); / * output: configurado por fora configurado por fora * /

source: Another final example, try to understand it.
pt_br: Entenda-o com cuidado.

source: class A {function A($i) {$this - value = $i; / / try to figure out why we do not need a reference here $this - b = new B($this);} function createRef() {$this - c = new B($this);} function echoValue() {echo "br" ,"class ",get_class($this) ,': ',$this - value;}} class B {function B ($a) {$this - a = $a;} function echoValue() {echo "br" ,"class ",get_class($this) ,': ',$this - a - value;}} / / try to undestand why using a simple copy here would yield / / in an undesired result in the *-marked line $a = new A(10); $a - createRef(); $a - echoValue(); $a - b - echoValue(); $a - c - echoValue(); $a - value = 11; $a - echoValue(); $a - b - echoValue(); / / * $a - c - echoValue(); / * output: class A:
pt_br: class A {function A($i) {$this - value = $i; / / tente entender porque aqui nos nao precisamos de referencia $this - b = new B($this);} function createRef() {$this - c = new B($this);} function echoValue() {echo "br" ,"classe ",get_class($this) ,': ',$this - value;}} class B {function B ($a) {$this - a = $a;} function echoValue() {echo "br" ,"classe ",get_class($this) ,': ',$this - a - value;}} / / Tente entender porque usando uma simples copia aqui ter / / um resultado indesejavel na linha marcada com * $a = new A(10); $a - createRef(); $a - echoValue(); $a - b - echoValue(); $a - c - echoValue(); $a - value = 11; $a - echoValue(); $a - b - echoValue(); / / * $a - c - echoValue(); / * output: classe A:

source: 10 class B:
pt_br: 10 classe B:

source: 10 class A:
pt_br: 10 classe A:

source: 11 class B:
pt_br: 11 classe B:

source: The magic functions __sleep and __wakeup
pt_br: As funções mágicas __sleep e __wakeup

source: References Explained
pt_br: Referências

source: In PHP 3, objects will lose their class association throughout the process of serialization and unserialization.
pt_br: No PHP 3, objetos perdem suas associações entre classes através do processo de serialização e desserialização.

source: The resulting variable is of type object, but has no class and no methods, thus it is pretty useless (it has become just like an array with a funny syntax).
pt_br: A variável resultante é do tipo objeto, mas sem classe nem métodos, algo bem sem utilidade (de fato, ele se torna apenas um array com uma sintaxe engraçada).

source: The following information is valid for PHP 4 only.
pt_br: As informações seguintes se aplicam somente ao PHP 4.

source: serialize() returns a string containing a byte-stream representation of any value that can be stored in PHP. unserialize() can use this string to recreate the original variable values.
pt_br: serialize() retorna uma string contendo uma representação linear de qualquer valor que pode ser armazenado no PHP. unserialize() pode ser utilizado para recriar os valores da variável original.

source: Using serialize to save an object will save all variables in an object.
pt_br: Usando serialize para salvar um objeto irá preservar todas as variáveis de um objeto.

source: The functions in an object will not be saved, only the name of the class.
pt_br: As funções de um objeto não serão salvas, apenas o nome da classe.

source: In order to be able to unserialize() an object, the class of that object needs to be defined.
pt_br: Para ser possível fazer o unserialize() de um objeto, a classe do objeto precisa estar definida.

source: That is, if you have an object $a of class A on page1.php and serialize this, you 'll get a string that refers to class A and contains all values of variabled contained in $a.
pt_br: Ou seja, se você tem um objeto $a da classe A em page1.php e a serializa, você consegue uma string que se refere a classe A e contém todos os valores de variáveis contidos em $a.

source: If you want to be able to unserialize this on page2.php, recreating $a of class A, the definition of class A must be present in page2.php.
pt_br: Se você precisa desserializa-la em page2.php, recriando $a da classe A, a definição da classe A precisa estar presente na page2.php.

source: This can be done for example by storing the class defintion of class A in an include file and including this file in both page1.php and page2.php.
pt_br: Isto pode por ser feito, por exemplo, armazenando a definição da classe A em um arquivo separado, incluindo este arquivo e ambos os arquivos page1.php e page2.php.

source: classa.inc: class A {var $one = 1; function show_one() {echo $this - one;}} page1.php: include("classa.inc"); $a = new A; $s = serialize($a); / / store $s somewhere where page2.php can find it. $fp = fopen("store", "w"); fputs($fp, $s); fclose($fp); page2.php: / / this is needed for the unserialize to work properly. include("classa.inc"); $s = implode("", @file("store")); $a = unserialize($s); / / now use the function show_one() of the $a object. $a - show_one();
pt_br: classe_a.inc.php: class A {var $um = 1; function mostre_um() {echo $this - um;}} page1.php: include("classe_a.inc.php"); $a = new A; $s = serialize($a); / / armazena $s em algum lugar que page2,php possa encontra-la $fp = fopen("armazenamento", "w"); fputs($fp, $s); fclose($fp); page2.php: / / Isto e preciso para que unserialize funcione normalmente include("classe_a.inc.php"); $s = implode("", @file("armazenamento")); $a = unserialize($s); / / Agora podemos usar a funcao mostre_um() do objeto $a $a - mostre_um();

source: If you are using sessions and use session_register() to register objects, these objects are serialized automatically at the end of each PHP page, and are unserialized automatically on each of the following pages.
pt_br: Se você está utilizando sessões e usar session_register() para registrar objetos, esses objetos serão serializados automaticamente no final de cada script PHP, e automaticamente desserializados em cada uma das páginas seguintes.

source: This basically means that these objects can show up on any of your pages once they become part of your session.
pt_br: Isto significa que esse objetos podem estar em qualquer uma de suas páginas desde que elas sejam parte de sua sessão.

source: It is strongly recommended that you include the class definitions of all such registered objects on all of your pages, even if you do not actually use these classes on all of your pages.
pt_br: É extremamente recomendável que você inclua as definições de classe de todos os objetos registrados de todas as suas páginas, mesmo que você não use essas classes em todas as suas páginas.

source: If you don 't and an object is being unserialized without its class definition being present, it will lose its class association and become an object of class stdClass without any functions available at all, that is, it will become quite useless.
pt_br: Se você não o fizer e um objeto for desserializado sem sua definição de classe presente, ele perde usa associação com a classe e se torna um objeto da classe stdClass, sem qualquer funções disponíveis. o que as deixa silenciosamente sem funcionalidade.

source: So if in the example above $a became part of a session by running session_register( "a"), you should include the file classa.inc on all of your pages, not only page1.php and page2.php.
pt_br: Assim, se no exemplo acima $a se tornar parte de uma sessão pela utilização de session_register( "a"), você precisa incluir o arquivo classe_a.inc.php em todos as suas páginas, não somente em page1.php e page2.php.

source: Chapter 11.
pt_br: Capítulo 11.

source: Remember basic arithmetic from school?
pt_br: Lembra-se da aritmética básica da escola?

source: These work just like those.
pt_br: Estes operadores funcionam exatamente como aqueles.

source: Table 11-2.
pt_br: Tabela 11-2.

source: Arithmetic Operators
pt_br: Operadores Aritméticos

source: Example
pt_br: Exemplo

source: Result
pt_br: Resultado

source: Addition
pt_br: Adição

source: Sum of $a and $b.
pt_br: Soma de $a e $b.

source: Subtraction
pt_br: Subtração

source: Difference of $a and $b.
pt_br: Diferença entre $a e $b.

source: Multiplication
pt_br: Multiplicação

source: Product of $a and $b.
pt_br: Produto de $a e $b.

source: Division
pt_br: Divisão

source: Quotient of $a and $b.
pt_br: Quociente de $a por $b.

source: Modulus
pt_br: Módulo

source: Remainder of $a divided by $b.
pt_br: Resto de $a dividido por $b.

source: The division operator ("/") returns a float value anytime, even if the two operands are integers (or strings that get converted to integers).
pt_br: O operador de divisão ("/") sempre retorna um valor com ponto flutuante, mesmo que os dois operandos sejam inteiros (ou strings que sejam convetidos para inteiros).

source: Assignment Operators
pt_br: Operadores de Atribuição

source: The only array operator in PHP is the + operator.
pt_br: O único operador de arrays no PHP é o +.

source: It appends the right handed array to the left handed, whereas duplicated keys are NOT overwritten.
pt_br: Ele acrescenta o array informado à direita no array informado à esquerda, onde chaves duplicadas NÃO são sobrescritos.

source: $a = array( "a "= "apple", "b" = "banana"); $b = array("a "= "pear", "b" = "strawberry", "c "= "cherry"); $c = $a + $b; var_dump($c);
pt_br: $a = array( "a "= "maçã", "b" = "banana"); $b = array("a "= "pêra", "b" = "framboesa", "c "= "morango"); $c = $a + $b; var_dump($c);

source: array( 3) {["a"]= string(5) "apple "["b"]= string(6) "banana" ["c"]= string(6) "cherry "}
pt_br: array( 3) {["a"]= string(5) "maçã "["b"]= string(6) "banana" ["c"]= string(6) "morango "}

source: String Operators
pt_br: Operadores de String

source: The basic assignment operator is "=".
pt_br: O operador básico de atribuição é "=".

source: Your first inclination might be to think of this as "equal to".
pt_br: A sua primeira inclinação deve ser a de pensar nisto como "é igual".

source: Don 't.
pt_br: Não.

source: It really means that the the left operand gets set to the value of the expression on the rights (that is, "gets set to").
pt_br: Isto quer dizer, na verdade, que o operando da esquerda recebe o valor da expressão da direita (ou seja, "é configurado para").

source: The value of an assignment expression is the value assigned.
pt_br: O valor de uma expressão de atribuição é o valor atribuído.

source: That is, the value of "$a = 3" is 3.
pt_br: Ou seja, o valor de "$a = 3" é 3.

source: This allows you to do some tricky things:
pt_br: Isto permite que você faça alguns truques:

source: $a = ($b = 4) + 5; / / $a is equal to 9 now, and $b has been set to 4.
pt_br: $a = ($b = 4) + 5; / / $a é igual a 9 agora e $b foi configurado como 4.

source: In addition to the basic assignment operator, there are "combined operators" for all of the binary arithmetic and string operators that allow you to use a value in an expression and then set its value to the result of that expression.
pt_br: Além do operador básico de atribuição, há "operadores combinados" para todos os operadores binários, aritméticos e de string, que permitem a você pegar um valor de uma expressão e então usar seu próprio valor para o resultado daquela expressão.

source: $a = 3; $a += 5; / / sets $a to 8, as if we had said: $a = $a + 5; $b = "Hello "; $b .= "There !"; / / sets $b to "Hello There !", just like $b = $b. "There !";
pt_br: $a = 3; $a += 5; / / configura $a para 8, como se disséssemos: $a = $a + 5; $b = "Bom "; $b .= "Dia !"; / / configura $b para "Bom Dia !", como em $b = $b. "Dia !";

source: Note that the assignment copies the original variable to the new one (assignment by value), so changes to one will not affect the other.
pt_br: Note que a atribuição copia a variável original para a nova (atribuição por valor), assim a mudança de uma não afeta a outra.

source: This may also have relevance if you need to copy something like a large array inside a tight loop.
pt_br: Isto pode ter relevância se você precisa copiar algo como uma grande matriz dentro de um loop longo.

source: PHP 4 supports assignment by reference, using the $var = $othervar; syntax, but this is not possible in PHP 3. 'Assignment by reference 'means that both variables end up pointing at the same data, and nothing is copied anywhere.
pt_br: O PHP 4 suporta atribuições por referência, usando a sintaxe $var = $outra_var;, mas isto não é possível no PHP3. 'Atribuição por referência 'significa que ambas as variáveis acabam apontando para os mesmos dados, e nada é copiado para lugar nenhum.

source: To learn more about references, please read References explained.
pt_br: Para aprender mais sobre referências, leia Referências explicadas.

source: Bitwise Operators
pt_br: Operador Bit-a-bit

source: Bitwise operators allow you to turn specific bits within an integer on or off.
pt_br: Operadores bit-a-bit permitem que você acione ou desligue bits específicos dentro de um inteiro.

source: If both the left - and right-hand parameters are strings, the bitwise operator will operate on the characters in this string.
pt_br: Se ambos os parâmetros da esquerda e da direita forem strings, esses operadores irão trabalhar nos caracteres dessa string.

source: ?php echo 12 ^ 9; / / Outputs '5 'echo "12 "^ "9"; / / Outputs the Backspace character (ascii 8) / / ('1' (ascii 49)) ^ ('9 '(ascii 57)) = #8 echo "hallo" ^ "hello"; / / Outputs the ascii values #0 #4 #0 #0 #0 / / 'a' ^ 'e '= #4?
pt_br: ?php echo 12 ^ 9; / / Imprime '5 'echo "12 "^ "9"; / / Imprime o caracter de volta (backspace - ASCII 8) / / ('1' (ASCII 49)) ^ ('9 '(ASCII 57)) = 8 echo "hallo" ^ "hello"; / / Imprime os valores ASCII 0 4 0 0 0 / / 'a' ^ 'e '= 4?

source: Table 11-3.
pt_br: Tabela 11-3.

source: And
pt_br: E

source: Bits that are set in both $a and $b are set.
pt_br: Os bits que estão ativos tanto em $a quanto em $b são ativados.

source: Or
pt_br: OU

source: Bits that are set in either $a or $b are set.
pt_br: Os bits que estão ativos em $a ou em $b são ativados.

source: Bits that are set in $a or $b but not both are set.
pt_br: Os bits que estão ativos em $a ou em $b, mas não em ambos, são ativados.

source: Not
pt_br: NÃO

source: Bits that are set in $a are not set, and vice versa.
pt_br: Os bits que estão ativos em $a não são ativados, e vice-versa.

source: Shift left
pt_br: Deslocamento à esquerda

source: Shift the bits of $a $b steps to the left (each step means "multiply by two")
pt_br: Desloca os bits de $a $b passos para a esquerda (cada passo significa "multiplica por dois")

source: Shift right
pt_br: Deslocamento à direita

source: Shift the bits of $a $b steps to the right (each step means "divide by two")
pt_br: Desloca os bits de $a $b passos para a direita (cada passo significa "divide por dois")

source: Comparison Operators
pt_br: Operadores de Comparação

source: Comparison operators, as their name implies, allow you to compare two values.
pt_br: Operadores de comparação, como os seus nomes implicam, permitem que você compare dois valores.

source: Table 11-4.
pt_br: Tabela 11-4.

source: Equal
pt_br: Igual

source: TRUE if $a is equal to $b.
pt_br: Verdadeiro (TRUE) se $a é igual a $b.

source: Identical
pt_br: Idêntico

source: TRUE if $a is equal to $b, and they are of the same type. (PHP 4 only)
pt_br: Verdadeiro (TRUE) se $a é igual a $b, e eles são do mesmo tipo (somente para PHP4).

source: Not equal
pt_br: Diferente

source: TRUE if $a is not equal to $b.
pt_br: Verdadeiro se $a não é igual a $b.

source: Not identical
pt_br: Não idêntico

source: TRUE if $a is not equal to $b, or they are not of the same type. (PHP 4 only)
pt_br: Verdadeiro de $a não é igual a $b, ou eles não são do mesmo tipo (somente para o PHP4).

source: Less than
pt_br: Menor que

source: TRUE if $a is strictly less than $b.
pt_br: Verdadeiro se $a é estritamente menor que $b.

source: Greater than
pt_br: Maior que

source: TRUE if $a is strictly greater than $b.
pt_br: Verdadeiro se $a é estritamente maior que $b.

source: Less than or equal to
pt_br: Menor ou igual

source: TRUE if $a is less than or equal to $b.
pt_br: Verdadeiro se $a é menor ou igual a $b.

source: Greater than or equal to
pt_br: Maior ou igual

source: TRUE if $a is greater than or equal to $b.
pt_br: Verdadeiro se $a é maior ou igual a $b.

source: Another conditional operator is the "?:" (or ternary) operator, which operates as in C and many other languages.
pt_br: Outro operador condicional é o operador "?:" (ou trinário), que opera como no C e em muitas outras linguagens.

source: Error Control Operators
pt_br: Operadores de controle de erro

source: PHP supports one error control operator: the at sign (@).
pt_br: O PHP suporta um operador de controle de erro: o sinal 'arroba' (@).

source: When prepended to an expression in PHP, any error messages that might be generated by that expression will be ignored.
pt_br: Quando ele precede uma expressão em PHP, qualquer mensagem de erro que possa ser gerada por aquela expressão será ignorada.

source: If the track_errors feature is enabled, any error message generated by the expression will be saved in the variable $php_errormsg.
pt_br: Se o recurso track_errors estiver habilitado, qualquer mensagem de erro gerada pela expressão será gravada na variável global $php_errormsg.

source: This variable will be overwritten on each error, so check early if you want to use it.
pt_br: Esta variável será sobrescrita em cada erro, assim verifique-a constantemente se você quiser usá-la.

source: ?php / * Intentional file error * / $my_file = @file ('non_existent_file') or die ("Failed opening file: error was '$php_errormsg'"); / / this works for any expression, not just functions: $value = @$cache[$key]; / / will not issue a notice if the index $key doesn't exist.?
pt_br: ?php / * Erro de arquivo intencional * / $my_file = @file ('arquivo_nao_existente') ou die ("Falha abrindo arquivo: '$php_errormsg'"); / / Isto funciona para qualquer expressão, não apenas para funções: $value = @$cache[$key]; / / você não receberá nenhum aviso se a chave $key não existir.?

source: The @-operator works only on expressions.
pt_br: O operador @ funciona somente em expressões.

source: A simple rule of thumb is: if you can take the value of something, you can prepend the @ operator to it.
pt_br: Uma regra simples para lembrar disso: se você pode pegar o valor de alguma coisa, você pode prefixar isso com o @.

source: For instance, you can prepend it to variables, function and include() calls, constants, and so forth.
pt_br: Assim, você pode prefixar chamadas de variáveis, funções e include() s, constantes e afins.
